package day4;
    /* 가정
우리는 게임개발회사에 입사했다.
우리에게는 성격좋은 사수 한명이 있다.
내가 개발할 게임은 오리시뮬레이션 게임이다.
선임이 나의 개발을 도와주진 않지만 조언은 해준다.
*/

/* 요구사항
- D1 요구 : 오리를 생성하고 날게하시오.
- D1 완료 : 클래스와 메서드를 만들어서 처리
- D2 요구 : 게임의 디테일을 살리기 위해서 `청둥오리`와 `흰오리`를 생성하고 날게하시오.
- D2 완료 : 클래스와 메서드를 만들어서 처리
- D3 요구 : 오리 계열의 클래스에 날다 메서드가 중복되었습니다. 중복을 제거해주세요.
- D3 완료 : 상속을 사용해서 처리
- D4 요구 : 게임의 재미를 위하여 고무오리를 추가하고 날게 하시오.
- D4 완료 : 클래스와 메서드를 만들어서 처리
- D5 요구 : 주말 주주회의에서 고무오리가 하늘을 날아다니는 것에 대해서 태클이 들어왔습니다. 고무오리 계열은 하늘을 날 수 없게 해주세요.
- D5 완료 : 메서드 오버라이드를 사용해서 처리
- D6 요구 : 고무오리가 반응이 좋습니다. 고무2오리를 추가하고 날게 해주세요.
- D6 완료 : 고무2오리 추가후 고무오리 상속으로 해결
- D7 요구 : 새로운 기능인 헤엄치기를 추가하고 오리처럼 날고 고무오리처럼 헤엄치는 아수라 오리를 추가해주세요.
*/

public class InheritanceExam {
    public static void main(String[] args) {
        오리 a오리 = new 오리();
        a오리.날다();

        청동오리 a청동 = new 청동오리();
        a청동.날다();

        흰오리 a흰 = new 흰오리();
        a흰.날다();

        고무오리 a고무 = new 고무오리();
        a고무.날다();


        고무2오리 a고2무 = new 고무2오리();
        a고2무.날다();

        아수라오리 a아수 = new 아수라오리();
        a아수.날다();
        a아수.헤엄치기();
    }
}
class 오리 {
    public void 날다(){
        System.out.println("오리가 날개로 날아갑니다!!!!");
    }
    public  void  헤엄치기(){
        System.out.println("오리가 헤엄칩니다!!!");
    }
}

class 청동오리 extends 오리{

}
class 흰오리 extends 오리{

}

class 고무오리 extends 오리{
    public void 날다(){
        // 메서드 오버라이드(재정의) => 부모한테 물려받은 메서드와 동일한 이름의 메서드를 자식이 다시 정의하는 것
        // 자신에게 가까운 메서드를 우선적으로 사용.
        System.out.println("저는 날수 없어요. ㅜㅠ");
//        super.날다(); // super 부모클래스 호출 부모클래스의 날다를 호출한다.
    }
    public  void  헤엄치기(){
        System.out.println("고무오리가 헤엄칩니다!!!");
    }
}

// 고무2오리의 메서드는 2개 (고무오리,오리)
class 고무2오리 extends 고무오리{

}
// 상속으로 모든 중복을 해결할 수는 없다
// 상속은 다른 클래스에 영향을 미친다 -> 캡슐화 깬다.
class 아수라오리 extends 오리{

}